Troughput-Latency-tests/oneRmServiceTest/onerm_10.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      10
Time taken for tests:   10.940 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    91.40 [#/sec] (mean)
Time per request:       109.403 [ms] (mean)
Time per request:       10.940 [ms] (mean, across all concurrent requests)
Transfer rate:          22.49 [Kbytes/sec] received
                        37.58 kb/s sent
                        60.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       45   52   3.0     51      67
Processing:    48   56   3.9     56      95
Waiting:       45   55   3.7     54      92
Total:         95  108   5.7    107     145

Percentage of the requests served within a certain time (ms)
  50%    107
  66%    110
  75%    111
  80%    112
  90%    115
  95%    119
  98%    122
  99%    124
 100%    145 (longest request)