Troughput-Latency-tests/oneRmServiceTest/onerm_100.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      100
Time taken for tests:   1.897 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    527.28 [#/sec] (mean)
Time per request:       189.653 [ms] (mean)
Time per request:       1.897 [ms] (mean, across all concurrent requests)
Transfer rate:          129.76 [Kbytes/sec] received
                        216.78 kb/s sent
                        346.54 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       47   56   4.7     54      75
Processing:    51  115  22.6    114     177
Waiting:       51  112  22.5    111     176
Total:         98  170  23.4    169     233

Percentage of the requests served within a certain time (ms)
  50%    169
  66%    177
  75%    185
  80%    191
  90%    202
  95%    214
  98%    226
  99%    228
 100%    233 (longest request)