Troughput-Latency-tests/oneRmServiceTest/onerm_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      50
Time taken for tests:   2.598 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    384.93 [#/sec] (mean)
Time per request:       129.894 [ms] (mean)
Time per request:       2.598 [ms] (mean, across all concurrent requests)
Transfer rate:          94.73 [Kbytes/sec] received
                        158.26 kb/s sent
                        252.99 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       46   54   3.7     54      84
Processing:    50   67  11.5     63     114
Waiting:       48   64  11.4     60     112
Total:         98  121  12.7    117     177

Percentage of the requests served within a certain time (ms)
  50%    117
  66%    122
  75%    127
  80%    130
  90%    138
  95%    144
  98%    159
  99%    166
 100%    177 (longest request)