Troughput-Latency-tests/oneRmServiceTest/onerm_70.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.204.111.58 (be patient)


Server Software:        nginx/1.27.2
Server Hostname:        35.204.111.58
Server Port:            30001

Document Path:          /api/onermcalculator
Document Length:        23 bytes

Concurrency Level:      70
Time taken for tests:   2.135 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      252000 bytes
Total body sent:        421000
HTML transferred:       23000 bytes
Requests per second:    468.43 [#/sec] (mean)
Time per request:       149.435 [ms] (mean)
Time per request:       2.135 [ms] (mean, across all concurrent requests)
Transfer rate:          115.28 [Kbytes/sec] received
                        192.59 kb/s sent
                        307.87 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       47   54   3.6     53      70
Processing:    52   81  17.4     77     150
Waiting:       49   79  17.4     74     147
Total:        104  135  18.8    131     207

Percentage of the requests served within a certain time (ms)
  50%    131
  66%    138
  75%    142
  80%    146
  90%    160
  95%    179
  98%    191
  99%    196
 100%    207 (longest request)